Tekla.Structures.Drawing.ReinforcementSetGroup
The ReinforcementSetGroup class defines a reinforcement set group in the drawing.
A model rebar set generates one or more groups of rebars for drawing purposes and each group is
represented in a drawing as a reinforcement set group.
ModelIdentifier is always zero for the ReinforcementSetGroup.

Tekla.Structures.Drawing.ReinforcementSetGroup.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.ReinforcementSetGroup class.

Tekla.Structures.Drawing.ReinforcementSetGroup.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.Drawing.ReinforcementSetGroup class with SkipLoadingAttributes flag
SkipLoadingAttributes:
The skip loading attributes, if set to true, attributes not loaded.

Tekla.Structures.Drawing.ReinforcementSetGroup.Attributes
Gets or sets the attributes of the reinforcement.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.

Tekla.Structures.Drawing.ReinforcementSetGroup.ReinforcementCustomPosition
Gets or sets the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.

Tekla.Structures.Drawing.ReinforcementSetGroup.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReinforcementSetGroup.GetModelIdentifiers
Gets the model identifiers of the single rebars in this reinforcement set group.
Returns: A list of model identifiers.

Tekla.Structures.Drawing.ReinforcementSetGroup.Initialize(System.Boolean)
The Initialize
SkipLoadingAttributes:  The SkipLoadingAttributes boolean